
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>附录B 锁定 · 云原生基础架构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="宋净超（Jimmy Song）">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="appendix-c-box-case-study.html" />
    
    
    <link rel="prev" href="appendix-a-patterns-for-network-resiilency.html" />
    

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"rootsongjc/cloud-native-infra","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://jimmysong.io" target="_blank" class="custom-link">回到主页</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/kubernetes-handbook/" target="_blank" class="custom-link">Kubernetes 中文指南</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/awesome-cloud-native/" target="_blank" class="custom-link">云原生开源项目大全</a>
        </li>
    
        
        <li>
            <a href="https://cloudnative.to" target="_blank" class="custom-link">云原生社区</a>
        </li>
    
        
        <li>
            <a href="https://jimmysong.io/docs/" target="_blank" class="custom-link">云原生资料库</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="foreword.html">
            
                <a href="foreword.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="what-is-cloud-native-infrastructure.html">
            
                <a href="what-is-cloud-native-infrastructure.html">
            
                    
                    第1章 什么是云原生基础架构？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="when-to-adopt-cloud-native.html">
            
                <a href="when-to-adopt-cloud-native.html">
            
                    
                    第2章 采纳云原生基础架构的时机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="evolution-of-cloud-native-developments.html">
            
                <a href="evolution-of-cloud-native-developments.html">
            
                    
                    第3章 云原生部署的演变
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="designing-infrastructure-applicaitons.html">
            
                <a href="designing-infrastructure-applicaitons.html">
            
                    
                    第4章 设计基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="developing-infrastructure-applications.html">
            
                <a href="developing-infrastructure-applications.html">
            
                    
                    第5章 开发基础架构应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="testing-cloud-native-infrastructure.html">
            
                <a href="testing-cloud-native-infrastructure.html">
            
                    
                    第6章 测试云原生基础架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="managing-cloud-native-applications.html">
            
                <a href="managing-cloud-native-applications.html">
            
                    
                    第7章 管理云原生应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="securing-applications.html">
            
                <a href="securing-applications.html">
            
                    
                    第8章 保护应用程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="implementing-cloud-native-infrasctructure.html">
            
                <a href="implementing-cloud-native-infrasctructure.html">
            
                    
                    第9章 实施云原生基础架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="appendix-a-patterns-for-network-resiilency.html">
            
                <a href="appendix-a-patterns-for-network-resiilency.html">
            
                    
                    附录A 网络弹性模式
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="appendix-b-lock-in.html">
            
                <a href="appendix-b-lock-in.html">
            
                    
                    附录B 锁定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="appendix-c-box-case-study.html">
            
                <a href="appendix-c-box-case-study.html">
            
                    
                    附录C Box：案例研究
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >附录B 锁定</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9644;&#x5F55;b-&#x9501;&#x5B9A;">&#x9644;&#x5F55;B &#x9501;&#x5B9A;</h1>
<p>&#x5173;&#x4E8E;&#x4F7F;&#x7528;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x548C;&#x907F;&#x514D;&#x4F9B;&#x5E94;&#x5546;&#x9501;&#x5B9A;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x4E89;&#x8BAE;&#x3002;&#x8FD9;&#x79CD;&#x8FA9;&#x8BBA;&#x5145;&#x6EE1;&#x4E86;&#x610F;&#x8BC6;&#x5FC3;&#x6001;&#x4E4B;&#x4E89;&#x3002;</p>
<p>&#x9501;&#x5B9A;&#x901A;&#x5E38;&#x662F;&#x5DE5;&#x7A0B;&#x5E08;&#x548C;&#x7BA1;&#x7406;&#x5C42;&#x5173;&#x5FC3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5E94;&#x8BE5;&#x5C06;&#x5176;&#x4E0E;&#x9009;&#x62E9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6216;&#x6846;&#x67B6;&#x4E00;&#x6837;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x98CE;&#x9669;&#x6765;&#x6743;&#x8861;&#x3002;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#x7684;&#x9009;&#x62E9;&#x662F;&#x9501;&#x5B9A;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5DE5;&#x7A0B;&#x5E08;&#x6709;&#x8D23;&#x4EFB;&#x4E86;&#x89E3;&#x98CE;&#x9669;&#x5E76;&#x8BC4;&#x4F30;&#x8FD9;&#x4E9B;&#x98CE;&#x9669;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x3002;</p>
<p>&#x5F53;&#x60A8;&#x9009;&#x62E9;&#x4F9B;&#x5E94;&#x5546;&#x6216;&#x6280;&#x672F;&#x65F6;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x9501;&#x5B9A;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x3002;</li>
<li>&#x9501;&#x5B9A;&#x662F;&#x4E00;&#x79CD;&#x98CE;&#x9669;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5F88;&#x9AD8;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x5916;&#x5305;&#x601D;&#x7EF4;&#x3002;</li>
</ul>
<h2 id="&#x9501;&#x5B9A;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;">&#x9501;&#x5B9A;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;</h2>
<p>&#x5728;&#x6280;&#x672F;&#x4E0A;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x9501;&#x5B9A;&#xFF1A;</p>
<p><strong>&#x6280;&#x672F;&#x9501;&#x5B9A;</strong></p>
<p>&#x6574;&#x4E2A;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x6808;&#x4E2D;&#x5E95;&#x5C42;&#x6280;&#x672F;</p>
<p><strong>&#x4F9B;&#x5E94;&#x5546;&#x9501;&#x5B9A;</strong></p>
<p>&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F5C;&#x4E3A;&#x9879;&#x76EE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x800C;&#x4F7F;&#x200B;&#x200B;&#x7528;&#x7684;&#x670D;&#x52A1;&#x548C;&#x8F6F;&#x4EF6;&#xFF08;&#x4F9B;&#x5E94;&#x5546;&#x9501;&#x5B9A;&#x8FD8;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EA;&#x5173;&#x6CE8;&#x670D;&#x52A1;&#xFF09;</p>
<h3 id="&#x6280;&#x672F;&#x9501;&#x5B9A;">&#x6280;&#x672F;&#x9501;&#x5B9A;</h3>
<p>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x9009;&#x62E9;&#x4ED6;&#x4EEC;&#x719F;&#x6089;&#x7684;&#x6280;&#x672F;&#x6216;&#x4E3A;&#x6B63;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x6700;&#x5927;&#x5229;&#x76CA;&#x7684;&#x6280;&#x672F;&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x662F;&#x4F9B;&#x5E94;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x6280;&#x672F;&#xFF08;&#x4F8B;&#x5982;.NET&#x548C;Oracle&#x6570;&#x636E;&#x5E93;&#xFF09;&#x5230;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#xFF08;&#x4F8B;&#x5982;Python&#x548C;PostgreSQL&#xFF09;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x7EA7;&#x522B;&#x63D0;&#x4F9B;&#x7684;&#x9501;&#x5B9A;&#x901A;&#x5E38;&#x8981;&#x6C42;&#x7B26;&#x5408;API&#x6216;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x5C06;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x66FF;&#x4EE3;&#x6280;&#x672F;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x901A;&#x5E38;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x8F6C;&#x6362;&#x6210;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x6280;&#x672F;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x6709;&#x5F88;&#x5927;&#x5F71;&#x54CD;&#x3002;</p>
<h3 id="&#x4F9B;&#x5E94;&#x5546;&#x9501;&#x5B9A;">&#x4F9B;&#x5E94;&#x5546;&#x9501;&#x5B9A;</h3>
<p>&#x4F9B;&#x5E94;&#x5546;&#xFF0C;&#x5982;&#x4E91;&#x63D0;&#x4F9B;&#x5546;&#xFF0C;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x7684;&#x9501;&#x5B9A;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x6B63;&#x5728;&#x6D88;&#x8D39;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x662F;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x8D44;&#x6E90;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BA1;&#x7B97;&#x548C;&#x5B58;&#x50A8;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x6258;&#x7BA1;&#x8F6F;&#x4EF6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;Gmail&#xFF09;&#x3002;</p>
<p>&#x6D88;&#x8D39;&#x8D44;&#x6E90;&#x7684;&#x5806;&#x6808;&#x8D8A;&#x9AD8;&#xFF0C;&#x5E94;&#x8BE5;&#x4ECE;&#x6D88;&#x8017;&#x7684;&#x8D44;&#x6E90;&#xFF08;&#x4F8B;&#x5982;Heroku&#xFF09;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x4EF7;&#x503C;&#x5C31;&#x8D8A;&#x9AD8;&#x3002;&#x9AD8;&#x5C42;&#x6B21;&#x8D44;&#x6E90;&#x662F;&#x4ECE;&#x5E95;&#x5C42;&#x8D44;&#x6E90;&#x4E2D;&#x62BD;&#x79BB;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x80FD;&#x4EA7;&#x54C1;&#x7684;&#x751F;&#x4EA7;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x3002;</p>
<h2 id="&#x9501;&#x5B9A;&#x662F;&#x4E00;&#x79CD;&#x98CE;&#x9669;">&#x9501;&#x5B9A;&#x662F;&#x4E00;&#x79CD;&#x98CE;&#x9669;</h2>
<p>&#x6280;&#x672F;&#x9501;&#x5B9A;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x51B3;&#x5B9A;&#x6216;&#x4E0E;&#x4F9B;&#x5E94;&#x5546;&#x8FBE;&#x6210;&#x4F7F;&#x7528;&#x8BE5;&#x6280;&#x672F;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x518D;&#x4E0E;&#x4F9B;&#x5E94;&#x5546;&#x8FBE;&#x6210;&#x652F;&#x6301;&#x534F;&#x8BAE;&#xFF0C;&#x5219;&#x60A8;&#x7684;&#x8F6F;&#x4EF6;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x4E2D;&#x65AD;&#x2014;&#x2014;&#x53EA;&#x662F;&#x53D8;&#x5F97;&#x81EA;&#x6211;&#x652F;&#x6301;&#x3002;</p>
<p>&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x51CF;&#x5C11;&#x6765;&#x81EA;&#x6280;&#x672F;&#x7684;&#x9501;&#x5B9A;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x3002;&#x4F7F;&#x7528;&#x5F00;&#x653E;&#x6807;&#x51C6;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x51CF;&#x5C11;&#x9501;&#x5B9A;&#xFF0C;&#x4F46;&#x4E86;&#x89E3;&#x5F00;&#x653E;&#x6807;&#x51C6;&#x4E0E;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x522B;&#x4EBA;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x5E76;&#x4E0D;&#x80FD;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x6807;&#x51C6;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4E13;&#x6709;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5F62;&#x6210;&#x975E;&#x5B98;&#x65B9;&#x6807;&#x51C6;&#xFF0C;&#x5141;&#x8BB8;&#x4ECE;&#x5B83;&#x4EEC;&#x8FC1;&#x79FB;&#x51FA;&#x53BB;&#xFF08;&#x5982;AWS S3&#xFF09;&#x3002;</p>
<p>&#x4F9B;&#x5E94;&#x5546;&#x9501;&#x5B9A;&#x7684;&#x539F;&#x56E0;&#x901A;&#x5E38;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x672F;&#x9501;&#x5B9A;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x4F9B;&#x5E94;&#x5546;&#x9501;&#x5B9A;&#x7684;&#x98CE;&#x9669;&#x9AD8;&#x4E8E;&#x6280;&#x672F;&#x98CE;&#x9669;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x5411;&#x4F9B;&#x5E94;&#x5546;&#x4E0D;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#xFF0C;&#x60A8;&#x7684;&#x7533;&#x8BF7;&#x5C06;&#x505C;&#x6B62;&#x8FD0;&#x884C;&#xFF1B;&#x4F60;&#x4E0D;&#x518D;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x4F60;&#x6240;&#x652F;&#x4ED8;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x4F9B;&#x5E94;&#x5546;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x4EF7;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5141;&#x8BB8;&#x4EA7;&#x54C1;&#x5F00;&#x53D1;&#x4E0D;&#x9700;&#x8981;&#x6240;&#x6709;&#x8F83;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x4E0D;&#x8981;&#x907F;&#x514D;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x6765;&#x6D88;&#x9664;&#x98CE;&#x9669;&#xFF1B;&#x4F60;&#x5E94;&#x8BE5;&#x50CF;&#x5BF9;&#x5F85;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x4E00;&#x6837;&#x6743;&#x8861;&#x670D;&#x52A1;&#x7684;&#x98CE;&#x9669;&#x548C;&#x56DE;&#x62A5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x6807;&#x51C6;&#x63A5;&#x53E3;&#xFF0C;&#x5219;&#x98CE;&#x9669;&#x975E;&#x5E38;&#x4F4E;&#x3002;&#x63A5;&#x53E3;&#x8D8A;&#x662F;&#x81EA;&#x5B9A;&#x4E49;&#xFF0C;&#x6216;&#x8005;&#x4EA7;&#x54C1;&#x8D8A;&#x72EC;&#x7279;&#xFF0C;&#x5207;&#x6362;&#x7684;&#x98CE;&#x9669;&#x5C31;&#x8D8A;&#x9AD8;&#x3002;</p>
<h2 id="&#x4E0D;&#x8981;&#x5916;&#x5305;&#x601D;&#x7EF4;">&#x4E0D;&#x8981;&#x5916;&#x5305;&#x601D;&#x7EF4;</h2>
<p>&#x672C;&#x4E66;&#x7684;&#x76EE;&#x6807;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5E2E;&#x52A9;&#x60A8;&#x81EA;&#x5DF1;&#x505A;&#x51FA;&#x51B3;&#x5B9A;&#x3002;&#x5728;&#x4E0D;&#x4E86;&#x89E3;&#x5EFA;&#x8BAE;&#x7684;&#x80CC;&#x666F;&#x548C;&#x662F;&#x5426;&#x9002;&#x7528;&#x4E8E;&#x60A8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x8981;&#x76F2;&#x76EE;&#x542C;&#x4ECE;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x610F;&#x89C1;&#x6216;&#x62A5;&#x544A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x6258;&#x7BA1;&#x4E91;&#x670D;&#x52A1;&#x66F4;&#x5FEB;&#x5730;&#x4EA4;&#x4ED8;&#x4EA7;&#x54C1;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4F9B;&#x5E94;&#x5546;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x3002;&#x867D;&#x7136;&#x8861;&#x91CF;&#x98CE;&#x9669;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x4F46;&#x5C06;&#x5927;&#x628A;&#x7684;&#x65F6;&#x95F4;&#x82B1;&#x8D39;&#x5728;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x591A;&#x5BB6;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x4E89;&#x8BBA;&#x4E0A;&#xFF0C;&#x53C8;&#x81EA;&#x5DF1;&#x6784;&#x5EFA;&#x670D;&#x52A1;&#x5E76;&#x4E0D;&#x80FD;&#x8282;&#x7EA6;&#x60A8;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5982;&#x679C;&#x591A;&#x4E2A;&#x4F9B;&#x5E94;&#x5546;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x8BF7;&#x9009;&#x62E9;&#x6700;&#x5BB9;&#x6613;&#x91C7;&#x7528;&#x7684;&#x670D;&#x52A1;&#x3002;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8BE5;&#x670D;&#x52A1;&#x540E;&#xFF0C;&#x9650;&#x5236;&#x5C06;&#x5F88;&#x5FEB;&#x663E;&#x73B0;&#x3002;&#x9009;&#x62E9;&#x4F9B;&#x5E94;&#x5546;&#x65F6;&#x6700;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x662F;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4E0E;&#x60A8;&#x5177;&#x6709;&#x76F8;&#x540C;&#x521B;&#x65B0;&#x6B65;&#x4F10;&#x7684;&#x4F9B;&#x5E94;&#x5546;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x521B;&#x65B0;&#x901F;&#x5EA6;&#x6BD4;&#x60A8;&#x5FEB;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5C06;&#x65E0;&#x6CD5;&#x5229;&#x7528;&#x5176;&#x6700;&#x65B0;&#x6280;&#x672F;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x4E0D;&#x5F97;&#x4E0D;&#x82B1;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x8FC1;&#x79FB;&#x65E7;&#x6280;&#x672F;&#x3002;&#x5982;&#x679C;&#x4F9B;&#x5E94;&#x5546;&#x7684;&#x521B;&#x65B0;&#x8FC7;&#x4E8E;&#x7F13;&#x6162;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x6839;&#x636E;&#x4F9B;&#x5E94;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x5185;&#x5BB9;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x800C;&#x4E14;&#x60A8;&#x4E0D;&#x4F1A;&#x4E13;&#x6CE8;&#x4E8E;&#x60A8;&#x7684;&#x4E1A;&#x52A1;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6D88;&#x8D39;&#x5C1A;&#x672A;&#x62E5;&#x6709;&#x6807;&#x51C6;&#x6216;&#x66FF;&#x4EE3;&#x54C1;&#x7684;&#x8D44;&#x6E90;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x65B0;&#x7684;&#x548C;&#x5B9E;&#x9A8C;&#x6027;&#x7684;&#x670D;&#x52A1;&#xFF09;&#x3002;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F1A;&#x4F7F;&#x4F60;&#x9677;&#x5165;&#x8FD9;&#x9879;&#x670D;&#x52A1;&#x800C;&#x5BB3;&#x6015;&#x3002;&#x91CD;&#x89C6;&#x4FDD;&#x6301;&#x7ADE;&#x4E89;&#x529B;&#x6216;&#x5931;&#x53BB;&#x5E02;&#x573A;&#x4EFD;&#x989D;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x60A8;&#x7684;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x5FEB;&#x5730;&#x521B;&#x65B0;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x60A8;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x7684;&#x98CE;&#x9669;&#x4EE5;&#x53CA;&#x60A8;&#x7684;&#x4E1A;&#x52A1;&#x6709;&#x591A;&#x5927;&#x98CE;&#x9669;&#x3002;&#x505A;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x5316;&#x56DE;&#x62A5;&#x548C;&#x5C06;&#x98CE;&#x9669;&#x964D;&#x81F3;&#x6700;&#x4F4E;&#x7684;&#x51B3;&#x7B56;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; 2017-2022 | Distributed under CC BY 4.0 | <a href="https://jimmysong.io" target="_blank">jimmysong.io</a> all right reserved.</span><span class="footer-modification"> Updated at 
2022-07-13 05:10:08
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="appendix-a-patterns-for-network-resiilency.html" class="navigation navigation-prev " aria-label="Previous page: 附录A 网络弹性模式">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="appendix-c-box-case-study.html" class="navigation navigation-next " aria-label="Next page: 附录C Box：案例研究">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"附录B 锁定","level":"1.14","depth":1,"next":{"title":"附录C Box：案例研究","level":"1.15","depth":1,"path":"appendix-c-box-case-study.md","ref":"appendix-c-box-case-study.md","articles":[]},"previous":{"title":"附录A 网络弹性模式","level":"1.13","depth":1,"path":"appendix-a-patterns-for-network-resiilency.md","ref":"appendix-a-patterns-for-network-resiilency.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","codesnippet","splitter","page-toc-button","back-to-top-button","-lunr","-search","search-plus","github-buttons@2.1.0","favicon@^0.0.2","tbfed-pagefooter@^0.0.1","3-ba","theme-default","-highlight","prism","prism-themes","sitemap-general","ga","lightbox"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © 2017-2022 | Distributed under CC BY 4.0 | <a href=https://jimmysong.io>jimmysong.io</a>","modify_label":" Updated at ","modify_format":"YYYY-MM-DD HH:mm:ss"},"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/rootsongjc/cloud-native-infra"},"editlink":{"base":"https://github.com/rootsongjc/cloud-native-infra/blob/master","label":"编辑此页"},"splitter":{},"adsense":{"client":"ca-pub-4029167986768912","slot":"2445941692","format":"auto","element":".page-inner section","position":"bottom"},"codesnippet":{},"sitemap-general":{"prefix":"https://jimmysong.io/cloud-native-infra"},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"lightbox":{"jquery":true,"sameUuid":false},"page-toc-button":{},"back-to-top-button":{},"prism-themes":{},"github-buttons":{"repo":"rootsongjc/cloud-native-infra","types":["star"],"size":"small"},"3-ba":{"configuration":"auto","token":"11f7d254cfa4e0ca44b175c66d379ecc"},"ga":{"configuration":"auto","token":"UA-93485976-1"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}},"insert-logo":{"url":"https://jimmysong.io/images/logo-black-text.png","style":"background: none; max-height: 100px; min-height: 30px"},"search-plus":{},"image-captions":{"caption":"图 _PAGE_LEVEL_._PAGE_IMAGE_NUMBER_：_CAPTION_"}},"theme":"default","author":"宋净超（Jimmy Song）","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"云原生基础架构","language":"zh-hans","links":{"sidebar":{"回到主页":"https://jimmysong.io","Kubernetes 中文指南":"https://jimmysong.io/kubernetes-handbook/","云原生开源项目大全":"https://jimmysong.io/awesome-cloud-native/","云原生社区":"https://cloudnative.to","云原生资料库":"https://jimmysong.io/docs/"}},"gitbook":"*","description":"云原生基础架构|Cloud Native Infrastructure 中文版"},"file":{"path":"appendix-b-lock-in.md","mtime":"2022-07-13T05:10:08.858Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-07-13T05:10:32.998Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-3-ba/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

